-- phpMyAdmin SQL Dump
-- version 4.9.5deb2
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Время создания: Авг 02 2022 г., 12:27
-- Версия сервера: 10.3.34-MariaDB-0ubuntu0.20.04.1
-- Версия PHP: 8.1.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `weatherForecast`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cities`
--

CREATE TABLE `cities` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `city_code` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `cities`
--

INSERT INTO `cities` (`id`, `name`, `city_code`) VALUES
(3, 'Харьков', 'kharkiv-14410'),
(4, 'Одесса', 'odesa-14413'),
(5, 'Запорожье (Мокрая)', 'zaporizhia-mokre-30328'),
(6, 'Киев (Жуляны)', 'kyiv-zhuliany-14411'),
(7, 'Львов', 'lviv-14412'),
(8, 'Днепр (Кодаки)', 'dnipro-kodaky-14408'),
(9, 'Киев', 'kyiv-4944'),
(10, 'Харьков', 'kharkiv-5053'),
(11, 'Днепр (Днепропетровск)', 'dnipro-5077'),
(12, 'Одесса', 'odessa-4982'),
(13, 'Донецк', 'donetsk-5080'),
(14, 'Запорожье', 'zaporizhia-5093'),
(15, 'Николаев', 'mykolaiv-4983'),
(16, 'Луганск', 'luhansk-5082'),
(17, 'Кривой Рог', 'kryvyi-rih-4978'),
(18, 'Мариуполь', 'mariupol-5104'),
(19, 'Херсон', 'kherson-4987'),
(20, 'Полтава', 'poltava-4957'),
(21, 'Сумы', 'sumy-4936'),
(22, 'Краматорск', 'kramatorsk-11929'),
(23, 'Макеевка', 'makiivka-11855'),
(24, 'Львов', 'lviv-4949'),
(25, 'Чернигов', 'chernihiv-4923'),
(26, 'Кременчуг', 'kremenchuk-4968'),
(27, 'Черкассы', 'cherkasy-4956'),
(28, 'Винница', 'vinnytsia-4962'),
(29, 'Горловка', 'horlivka-5083'),
(30, 'Мелитополь', 'melitopol-5103'),
(31, 'Кропивницкий (Кировоград)', 'kropyvnytskyi-4975'),
(32, 'Житомир', 'zhytomyr-4943'),
(33, 'Каменское (Днепродзержинск)', 'kamyanske-11850'),
(34, 'Белая Церковь', 'bila-tserkva-4953'),
(35, 'Бердянск', 'berdiansk-5105'),
(36, 'Славянск', 'slovyansk-11854'),
(37, 'Энергодар', 'enerhodar-11856'),
(38, 'Хмельницкий', 'khmelnytskyi-4952'),
(39, 'Черновцы', 'chernivtsi-4972'),
(40, 'Павлоград', 'pavlohrad-5076'),
(41, 'Луцк', 'lutsk-4928'),
(42, 'Никополь', 'nikopol-4979'),
(43, 'Лисичанск', 'lysychansk-11876'),
(44, 'Рубежное', 'rubizhne-11034'),
(45, 'Измаил', 'izmail-4986'),
(46, 'Алчевск', 'alchevsk-11879'),
(47, 'Северодонецк', 'sievierodonetsk-11875'),
(48, 'Хрустальный (Красный Луч)', 'khrustalnyi-11877'),
(49, 'Енакиево', 'yenakiieve-11346'),
(50, 'Бахмут (Артёмовск)', 'bakhmut-5078'),
(51, 'Черноморск (Ильичевск)', 'chornomorsk-11870'),
(52, 'Сорокино (Краснодон)', 'sorokyne-11344'),
(53, 'Покровск (Красноармейск)', 'pokrovsk-5079'),
(54, 'Кадиевка (Стаханов)', 'kadiivka-11867'),
(55, 'Новая Каховка', 'nova-kakhovka-4985'),
(56, 'Ровно', 'rivne-4940'),
(57, 'Александрия', 'oleksandria-11048'),
(58, 'Ивано-Франковск', 'ivano-frankivsk-4959'),
(59, 'Умань', 'uman-4964'),
(60, 'Каменец-Подольский', 'kamianets-podilskyi-4961'),
(61, 'Смела', 'smila-4965'),
(62, 'Симферополь', 'simferopol-4995'),
(63, 'Константиновка', 'kostiantynivka-11347'),
(64, 'Тернополь', 'ternopil-4951'),
(65, 'Должанск (Свердловск)', 'dovzhansk-12125'),
(66, 'Чистяково (Торез)', 'chistyakove-11345'),
(67, 'Харцызск', 'khartsyzk-5081'),
(68, 'Бердичев', 'berdychiv-11036'),
(69, 'Южноукраинск', 'yuzhnoukrainsk-11871'),
(70, 'Светловодск', 'svitlovodsk-4967'),
(71, 'Могилев-Подольский', 'mohyliv-podilskyi-12399'),
(72, 'Шахтерск', 'shakhtarsk-11853'),
(73, 'Бровары', 'brovary-11865'),
(74, 'Коростень', 'korosten-4931'),
(75, 'Новомосковск', 'novomoskovsk-10961'),
(76, 'Мирноград (Димитров)', 'myrnohrad-12382'),
(77, 'Приморск', 'prymorsk-11040'),
(78, 'Дружковка', 'druzhkivka-12384'),
(79, 'Антрацит', 'antratsyt-11878'),
(80, 'Изюм', 'izium-5070'),
(81, 'Первомайск', 'pervomaisk-4974'),
(82, 'Витачов', 'vytachiv-84445'),
(83, 'Ахтырка', 'okhtyrka-12236'),
(84, 'Ровеньки', 'rovenky-11640'),
(85, 'Конотоп', 'konotop-4934'),
(86, 'Лохвица', 'lokhvytsia-12199'),
(87, 'Марганец', 'marhanets-11857'),
(88, 'Горишние Плавни (Комсомольск)', 'horishni-plavni-12210'),
(89, 'Севастополь', 'sevastopol-5003'),
(90, 'Геническ', 'henichesk-4989'),
(91, 'Торецк (Дзержинск)', 'toretsk-11323'),
(92, 'Белгород-Днестровский', 'bilhorod-dnistrovskyi-12167'),
(93, 'Нежин', 'nizhyn-4933'),
(94, 'Голая Пристань', 'hola-prystan-12281'),
(95, 'Прилуки', 'pryluky-4947'),
(96, 'Мерефа', 'merefa-13913'),
(97, 'Борисполь', 'boryspil-4945'),
(98, 'Красноград', 'krasnohrad-5068'),
(99, 'Покров (Орджоникидзе)', 'pokrov-12365'),
(100, 'Мукачево', 'mukacheve-4960'),
(101, 'Каховка', 'kakhovka-12285'),
(102, 'Чугуев', 'chuhuiv-12830'),
(103, 'Миргород', 'myrhorod-11869'),
(104, 'Доброполье', 'dobropillia-12372'),
(105, 'Первомайский', 'pervomaiskyi-12829'),
(106, 'Авдеевка', 'avdiivka-11340'),
(107, 'Ужгород', 'uzhhorod-4969'),
(108, 'Лубны', 'lubny-4948'),
(109, 'Шостка', 'shostka-11868'),
(110, 'Новоград-Волынский', 'novohrad-volynskyi-4941'),
(111, 'Середина-Буда', 'seredyna-buda-12238'),
(112, 'Снежное', 'snizhne-12016'),
(113, 'Барышевка', 'baryshivka-12070'),
(114, 'Заводское (Червонозаводское)', 'zavodske-13839'),
(115, 'Каменка-Днепровская', 'kamyanka-dniprovska-12049'),
(116, 'Лозовая', 'lozova-5069'),
(117, 'Жёлтые Воды', 'zhovti-vody-10911'),
(118, 'Купянск', 'kupyansk-5055'),
(119, 'Канев', 'kaniv-12311'),
(120, 'Терновка', 'ternivka-12367'),
(121, 'Кирилловка', 'kyrylivka-13424'),
(122, 'Станица Луганская', 'stanytsia-luhanska-12127'),
(123, 'Ирпень', 'irpin-11862'),
(124, 'Лисогорка', 'lysohirka-99370'),
(125, 'Гнаровское', 'hnarovske-82287'),
(126, 'Балаклея', 'balaklia-12258'),
(127, 'Волчанск', 'vovchansk-12264'),
(128, 'Лиман (Красный Лиман)', 'lyman-12373'),
(129, 'Старобельск', 'starobilsk-12128'),
(130, 'Ромны', 'romny-4935'),
(131, 'Курахово', 'kurakhove-13202'),
(132, 'Иршава', 'irshava-11998'),
(133, 'Николаевка', 'mykolaivka-12011'),
(134, 'Вознесенск', 'voznesensk-12155'),
(135, 'Знаменка', 'znamyanka-4966'),
(136, 'Новооржицкое', 'novoorzhytske-13836'),
(137, 'Литин', 'lityn-12398'),
(138, 'Обухов', 'obukhiv-11310'),
(139, 'Ульяники', 'ulianyky-84277'),
(140, 'Васильков', 'vasylkiv-11864'),
(141, 'Ялта', 'yalta-5002'),
(142, 'Нетешин', 'netishyn-12302'),
(143, 'Подольск (Котовск)', 'podilsk-12174'),
(144, 'Червоноград', 'chervonohrad-11872'),
(145, 'Славутич', 'slavutych-11308'),
(146, 'Сватово', 'svatove-12124'),
(147, 'Селидово', 'selydove-12015'),
(148, 'Волноваха', 'volnovakha-12370'),
(149, 'Золотоноша', 'zolotonosha-4955'),
(150, 'Крестовка (Кировское)', 'khrestivka-12386'),
(151, 'Ясиноватая', 'yasynuvata-11339'),
(152, 'Буковель', 'bukovel-58175'),
(153, 'Гуляйполе', 'huliaipole-12048'),
(154, 'Московское', 'moskovske-80006'),
(155, 'Кальмиусское (Комсомольское)', 'kalmiuske-13225'),
(156, 'Комиссаровка', 'komisarivka-13670'),
(157, 'Берестовое', 'berestove-79055'),
(158, 'Петрово-Красноселье (Петровское)', 'petrovo-krasnosillia-87467'),
(159, 'Брянка', 'brianka-12129'),
(160, 'Фастов', 'fastiv-12087'),
(161, 'Северск', 'siversk-13210'),
(162, 'Сновск (Щорс)', 'snovsk-4924'),
(163, 'Южное', 'yuzhne-12187'),
(164, 'Раденск', 'radensk-98584'),
(165, 'Олешки (Цюрупинск)', 'oleshky-12290'),
(166, 'Никольское', 'mykilske-98037'),
(167, 'Токмак', 'tokmak-12822'),
(168, 'Боярка', 'boyarka-13505'),
(169, 'Белоцерковка', 'bilotserkivka-82499'),
(170, 'Берислав', 'beryslav-12276'),
(171, 'Тетиев', 'tetiiv-12086'),
(172, 'Чаплинка', 'chaplynka-12291'),
(173, 'Сквира', 'skvyra-12083'),
(174, 'Синельниково', 'synelnykove-12357'),
(175, 'Соколовка', 'sokolivka-100158'),
(176, 'Украинка', 'ukrainka-11309'),
(177, 'Килия', 'kilia-12171'),
(178, 'Степанцы', 'stepantsi-100333'),
(179, 'Казанка', 'kazanka-10919'),
(180, 'Слобожанское (Комсомольское)', 'slobozhanske-12828'),
(181, 'Старобешево', 'starobesheve-12378'),
(182, 'Ковель', 'kovel-4926'),
(183, 'Лутугино', 'lutuhyne-12117'),
(184, 'Феодосия', 'feodosia-4999'),
(185, 'Нововолынск', 'novovolynsk-11859'),
(186, 'Буча', 'bucha-11362'),
(187, 'Пологи', 'polohy-12052'),
(188, 'Черноморка', 'chornomorka-90022'),
(189, 'Керчь', 'kerch-5001'),
(190, 'Мирное', 'myrne-83869'),
(191, 'Процев', 'protsiv-83873'),
(192, 'Жмеринка', 'zhmerynka-11860'),
(193, 'Носовка', 'nosivka-12343'),
(194, 'Верхнеднепровск', 'verkhnodniprovsk-12351'),
(195, 'Докучаевск', 'dokuchayevsk-12383'),
(196, 'Страхолесье', 'strakholissia-84226'),
(197, 'Бар', 'bar-13118'),
(198, 'Новгород-Северский', 'novhorod-siverskyi-12342'),
(199, 'Люботин', 'liubotyn-12275'),
(200, 'Великие Копани', 'velyki-kopani-13947'),
(201, 'Троицкое', 'troitske-12825'),
(202, 'Змиев', 'zmiiv-12013');

-- --------------------------------------------------------

--
-- Структура таблицы `city_weather`
--

CREATE TABLE `city_weather` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `city_id` int(10) NOT NULL,
  `date` varchar(10) NOT NULL,
  `temperature_max` varchar(10) NOT NULL,
  `temperature_min` varchar(10) NOT NULL,
  `image` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `city_weather`
--

INSERT INTO `city_weather` (`id`, `city_id`, `date`, `temperature_max`, `temperature_min`, `image`) VALUES
(1, 9, '1 авг', '+29', '+18', NULL),
(2, 9, '2 авг', '+21', '+19', NULL),
(3, 9, '3', '+20', '+18', NULL),
(4, 9, '4', '+29', '+18', NULL),
(5, 9, '5', '+30', '+18', NULL),
(6, 9, '6', '+32', '+20', NULL),
(7, 9, '7', '+26', '+18', NULL),
(8, 9, '8', '+25', '+15', NULL),
(9, 9, '9', '+27', '+16', NULL),
(10, 9, '10', '+25', '+14', NULL),
(11, 9, '11', '+26', '+15', NULL),
(12, 9, '12', '+30', '+16', NULL),
(13, 9, '13', '+29', '+18', NULL),
(14, 9, '14', '+27', '+15', NULL),
(15, 9, '15', '+31', '+17', NULL),
(16, 9, '16', '+34', '+19', NULL),
(17, 9, '17', '+38', '+21', NULL),
(18, 9, '18', '+24', '+19', NULL),
(19, 9, '19', '+24', '+16', NULL),
(20, 9, '20', '+24', '+16', NULL),
(21, 9, '21', '+22', '+14', NULL),
(22, 9, '22', '+22', '+11', NULL),
(23, 9, '23', '+24', '+11', NULL),
(24, 9, '24', '+27', '+13', NULL),
(25, 9, '25', '+27', '+16', NULL),
(26, 9, '26', '+21', '+16', NULL),
(27, 9, '27', '+22', '+13', NULL),
(28, 9, '28', '+19', '+14', NULL),
(29, 9, '29', '+23', '+11', NULL),
(30, 9, '30', '+25', '+14', NULL),
(31, 9, '31', '+25', '+18', NULL),
(32, 9, '1 сен', '+28', '+19', NULL),
(33, 9, '2', '+25', '+20', NULL),
(34, 9, '3', '+23', '+13', NULL),
(35, 9, '4', '+24', '+14', NULL),
(36, 9, '5', '+17', '+14', NULL),
(37, 9, '6', '+14', '+12', NULL),
(38, 9, '7', '+13', '+11', NULL),
(39, 9, '8', '+15', '+8', NULL),
(40, 9, '9', '+12', '+5', NULL),
(41, 9, '10', '+10', '+5', NULL),
(42, 9, '11', '+12', '+7', NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `cities`
--
ALTER TABLE `cities`
  ADD UNIQUE KEY `id` (`id`);

--
-- Индексы таблицы `city_weather`
--
ALTER TABLE `city_weather`
  ADD UNIQUE KEY `id` (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `cities`
--
ALTER TABLE `cities`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=203;

--
-- AUTO_INCREMENT для таблицы `city_weather`
--
ALTER TABLE `city_weather`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
